In [1]:
# Initial imports
import pandas as pd
import numpy as np
import datetime as dt
from pathlib import Path

%matplotlib inline

In [23]:
# Reading and dropping duplicates dataset 1
aapl_historical_csv = Path('Resources/aapl_historical.csv')
aapl_historical = pd.read_csv(aapl_historical_csv, index_col='Trade DATE', parse_dates=True, infer_datetime_format=True)
aapl_historical.drop_duplicates()
aapl_historical.isnull()
aapl_historical.dropna()

           Symbol    NOCP
Trade DATE
2019-05-09   AAPL  200.72
2019-05-08   AAPL  202.90
2019-05-07   AAPL  202.86
2019-05-06   AAPL  208.48
2019-05-03   AAPL  211.75
...           ...     ...
2018-05-17   AAPL  186.99
2018-05-16   AAPL  188.18
2018-05-15   AAPL  186.44
2018-05-14   AAPL  188.15
2018-05-11   AAPL  188.59

[250 rows x 2 columns]

In [22]:
# Reading and dropping duplicates dataset 2
algo_returns_csv = Path('Resources/algo_returns.csv')
algo_returns = pd.read_csv(algo_returns_csv, index_col='Date', parse_dates=True, infer_datetime_format=True)
algo_returns.drop_duplicates()
algo_returns.isnull()
algo_returns.dropna()

              Algo 1    Algo 2
Date
2014-06-05  0.004062  0.013285
2014-06-06  0.001857  0.008284
2014-06-09 -0.005012  0.005668
2014-06-10  0.004406 -0.000735
2014-06-11  0.004760 -0.003761
...              ...       ...
2019-04-25  0.000682 -0.007247
2019-04-26  0.002981  0.005256
2019-04-29  0.005208  0.002829
2019-04-30 -0.002944 -0.001570
2019-05-01  0.000094 -0.007358

[1235 rows x 2 columns]

In [20]:
# Reading and dropping duplicates dataset 3
cost_historical_csv = Path('Resources/cost_historical.csv')
cost_historical = pd.read_csv(cost_historical_csv, index_col='Trade DATE', parse_dates=True, infer_datetime_format=True)
cost_historical.drop_duplicates()
cost_historical.isnull()
cost_historical.dropna()

           Symbol    NOCP
Trade DATE
2019-05-09   COST  243.47
2019-05-08   COST  241.34
2019-05-07   COST  240.18
2019-05-06   COST  244.23
2019-05-03   COST  244.62
...           ...     ...
2018-05-17   COST  199.60
2018-05-16   COST  198.71
2018-05-15   COST  195.48
2018-05-14   COST  195.88
2018-05-11   COST  195.76

[250 rows x 2 columns]

In [19]:
# Reading and dropping duplicates dataset 4
goog_historical_csv = Path('Resources/goog_historical.csv')
goog_historical = pd.read_csv(goog_historical_csv, index_col='Trade DATE', parse_dates=True, infer_datetime_format=True)
goog_historical.drop_duplicates()
goog_historical.isnull()
goog_historical.dropna()

           Symbol     NOCP
Trade DATE
2019-05-09   GOOG  1162.38
2019-05-08   GOOG  1166.27
2019-05-07   GOOG  1174.10
2019-05-06   GOOG  1189.39
2019-05-03   GOOG  1185.40
...           ...      ...
2018-05-17   GOOG  1078.59
2018-05-16   GOOG  1081.77
2018-05-15   GOOG  1079.23
2018-05-14   GOOG  1100.20
2018-05-11   GOOG  1098.26

[250 rows x 2 columns]

In [12]:
# Reading and dropping dupplicates dataset 5
sp500_historical_csv = Path('Resources/sp500_history.csv')
sp500_historical = pd.read_csv(sp500_historical_csv, index_col='Date', parse_dates=True, infer_datetime_format=True)
sp500_historical.drop_duplicates()

               Close
Date
2019-04-23  $2933.68
2019-04-22  $2907.97
2019-04-18  $2905.03
2019-04-17  $2900.45
2019-04-16  $2907.06
...              ...
2012-10-05  $1460.93
2012-10-04  $1461.40
2012-10-03  $1450.99
2012-10-02  $1445.75
2012-10-01  $1444.49

[1639 rows x 1 columns]

In [18]:
# Reading and dropping duplicates dataset 6
whale_returns_csv = Path('Resources/whale_returns.csv')
whale_returns = pd.read_csv(whale_returns_csv, index_col='Date', parse_dates=True, infer_datetime_format=True)
whale_returns.drop_duplicates()
whale_returns.isnull()
whale_returns.dropna()

,SOROS FUND MANAGEMENT LLC,PAULSON & CO.INC.,TIGER GLOBAL MANAGEMENT LLC,BERKSHIRE HATHAWAY INC
Date,,,,
2015-03-03,-0.001266,-0.004981,-0.000496,-0.006569
2015-03-04,0.002230,0.003241,-0.002534,0.004213
2015-03-05,0.004016,0.004076,0.002355,0.006726
2015-03-06,-0.007905,-0.003574,-0.008481,-0.013098
2015-03-09,0.000582,0.004225,0.005843,-0.001652
...,...,...,...,...
2019-04-25,-0.000285,-0.001291,-0.005153,0.004848
2019-04-26,0.008149,0.009162,0.012355,0.010434
2019-04-29,0.001254,0.002719,0.006251,0.005223
2019-04-30,-0.001295,-0.002211,-0.000259,-0.003702
2019-05-01,-0.005847,-0.001341,-0.007936,-0.007833